#შევქმენით ფუნქცია სახელად primorial სადაც გავაკეთებთ დიაპაზონში მარტივ ნამრავლს

def primorial(n):
    #შევქმენით სია სახელად l სადაც შევინახავთ მარტივ რიცხვებს
    primes = []
    #გავაკეთეთ დიაპაზონი და გადავუარეთ for ციკლით 
    for num in range(1,n+ 1):
        #ვამოწმებთ რიცხვი მეტია ერთზე თუ არა თუ მეტია ერთზე მაშინ შესრულედება შემდეგი პირობა:
        if num > 1:
            for i in range(2,num):
                if (num % i) == 0:
                    break
            else:
                primes.append(num)
    #სიაში მარტივი რიცხვების ჩამატების შემდეგ უკვე უნდა გამოვითვალოთ მათი ნამრავლი პირველ რიგში შევქმენით mult ცვლადი რომელშიც შეინახება ნამრავლი
    mult = 1
    #for ციკლით გადავუარეთ ჩვენს primes სიას სა გამოვთვალეთ მათი ნამრავლი
    for i in primes:
        mult *= i
    #ბოლოს კი დავაბრუნეთ საბოლოო შედეგი
    return mult



print(primorial(5))
print(primorial(10))
print(primorial(1))
print(primorial(7))
print(primorial(11))